练习 23: 阅读一些程序代码
经过上一周的练习，你应该已经牢记了你的符号列表。现在你需要再花一周的时
间，应用这 些知识，在网上阅读程序代码。这个任务初看会觉得很艰巨。我将
直接把你丢到深水区呆几天，让你竭尽全力去读懂实实在在的专题里的程序代码。
这节练习的目的不是 让你读懂，而是让你学会下面的技能：
1. 找到你需要的 Ruby 程序代码。
2. 通读程序代码，找到文件。
3. 尝试理解你找到的程序代码。
4. 以你现在的水准，你还不具备完全理解你找到的程序代码的能力，不过通过接触这些程序代
码，你可以熟悉真正的程式专题会是什么样子。
当你做这节练习时，你可以把自己当成是一个人类学家来到了一片陌生的大陆，
你只懂得一丁点本地语言，但你需要接触当地人并且生存下去。当然做练习不会
碰到生存问题，这毕竟这不是荒野或者丛林。
你要做的事情如下：

1. 使用你的浏览器登录 github.com，搜寻「ruby」。
2. 随便找一个专题，然后点进去。
3. 点击 Source 标签，浏览目录和文件列表，直到你看到以 .rb 结尾的文件
4. 从头开始阅读你找到的程序代码。把它的功能用笔记记下来。
5. 如果你看到一些有趣的符号或者奇怪的字串，你可以把它们记下来，日后再进行研究。
就是这样，你的任务是使用你目前学到的东西，看自己能不能读懂一些程序代码，
看出它们的功能来。你可以先粗略地阅读，然后再细读。也许你还可以试试将难
度比较大的部分一字不漏地朗读出来。
现在再试试其它的几个站：
 heroku.com
 rubygems.org
 bitbucket.org
